io = input("Введите имя оператора: ")
fio = input("Введите текущее значение давления (Па):")
 

# 2. РАБОТА С ФАЙЛОМ
# Менеджер контекста 'with' гарантирует закрытие файла.
# "w" — режим записи (write), очищает файл перед работой.
with open("sensor_log.txt", "w", encoding="utf-8") as file:
    
    # 3. ФОРМИРОВАНИЕ СТРОКИ И ЗАПИСЬ
    # \t — табуляция (отступ), \n — перенос на новую строку.
    file.write("+___________________________________________________________+ \n")
    
    file.write(f"\t{io}\t|\t{fio}\n") 
    file.write("+___________________________________________________________+")
    
print ("Файл 'sensor_log.txt' успешно сформирован!")