 # 1. ВВОД ДАННЫХ
# Функция input() выводит текст и ждет ввода от пользователя.
fio = input("Введите название питательной среды:")
symptoms = input("Введите концентрацию агара (%):")
io = input("Введите температуру стерилизации (°C): ")

# 2. РАБОТА С ФАЙЛОМ
# Менеджер контекста 'with' гарантирует закрытие файла.
# "w" — режим записи (write), очищает файл перед работой.
with open("recipe.txt", "w", encoding="utf-8") as file:
    
    # 3. ФОРМИРОВАНИЕ СТРОКИ И ЗАПИСЬ
    # \t — табуляция (отступ), \n — перенос на новую строку.
    file.write(f"введите название питательной среды: card.write {fio} \n ")
    file.write(f"Введите концентрацию агара (%): {symptoms} \n")
    file.write(f"Введите температуру стерилизации (°C): {io} \n")    
    
print ("Файл 'recipe.txt' успешно сформирован!")
